/**
 * В этом пакете содержатся классы для сравнения списков чисел.
 * Основным классом в этом пакете является ListComparator,
 * который сравнивает два списка
 * на основе их средних значений с использованием ListCalculator
 * для выполнения математических операций.
 *
 * <p>Классы в этом пакете:
 * <ul>
 *     <li>{@link example.org.ListComparator} -
 *     Сравнивает два списка чисел.</li>
 *     <li>{@link example.org.ListCalculator} -
 *     Выполняет математические операции над списками чисел.</li>
 * </ul>
 */
package example.org;
